In [30]:
import numpy as np
import pandas as pd

In [31]:
df = pd.read_csv('spam.csv', encoding="ISO-8859-1")
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
3044,ham,"Hello, yeah i've just got out of the bath and ...",NaN,NaN,NaN
609,ham,"It's fine, imma get a drink or somethin. Want ...",NaN,NaN,NaN
1481,ham,"I'm a guy, browsin is compulsory",NaN,NaN,NaN
2496,ham,HCL chennai requires FRESHERS for voice proces...,NaN,NaN,NaN
2445,ham,The guy (kadeem) hasn't been selling since the...,NaN,NaN,NaN

DATA CLEANING

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [33]:
#drop last 3 cols
df.drop(columns = ['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], inplace=True)

In [34]:
df.sample(5)

       v1                                                 v2
3957  ham         So i could kiss and feel you next to me...
1496  ham  I'm always on yahoo messenger now. Just send t...
2783  ham       Just arrived, see you in a couple days &lt;3
3379  ham                  Just finished. Missing you plenty
3743  ham  Nobody names their penis a girls name this sto...

In [35]:
#renaming the columns
df.rename(columns={'v1': 'target', 'v2': 'text'}, inplace=True)
df.sample()

     target                                           text
4259    ham  Are you plans with your family set in stone ?

In [36]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [37]:
df['target'] = encoder.fit_transform(df['target'])

In [38]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [39]:
# missing values
df.isnull().sum()

target    0
text      0
dtype: int64

In [40]:
# check for duplicates
df.duplicated().sum()

403

In [42]:
# remove duplicates
df = df.drop_duplicates(keep= 'first')
df.duplicated().sum()

0